{
    "toggleLanguage": "Switch to English",
    "skills": "Beceriler",
    "projects": "Projeler",
    "hireMe": "Beni İşe Al",
    "profile": "Profile",
    "welcomeTitle": "Yaratıcı ve Sadeliğe önem veren bir yaklaşım..",
    "welcomeDesc": "Merhaba, ben Emirkan. Front-end geliştiriciyim. Harika kullanıcı deneyimlerine sahip, sağlam ve ölçeklenebilir frontend ürünleri geliştirecek birini arıyorsanız, gelin birlikte harika işler başaralım!",
    "contactEmail": "emirkanulker08@gmail.com",
    "javaScript": "JavaScript, web sitelerine etkileşim kazandırmak için kullanılan en yaygın programlama dilidir. Bu dil sayesinde internet sayfalarında butonlara tıklama, form doldurma gibi işlemler dinamik hale gelir. Günümüzde sadece tarayıcılarda değil, Node.js teknolojisi sayesinde sunucularda da kullanılmaktadır. Bu özelliğiyle JavaScript, hem ön yüz hem de arka yüz geliştirmede kullanılabilen çok yönlü bir dildir. Kısacası JavaScript, modern internetin temel yapı taşlarından biridir ve onu öğrenmek yazılım dünyasında büyük bir adım atmaktır.",
    "reactJs": "ReactJS, kullanıcı arayüzleri oluşturmak için kullanılan, JavaScript tabanlı bir kütüphanedir. Facebook tarafından geliştirilmiştir ve günümüzde en popüler frontend (ön yüz) teknolojilerinden biridir. React, bileşen (component) yapısı sayesinde kodların daha düzenli, yeniden kullanılabilir ve kolay yönetilebilir olmasını sağlar. Ayrıca sanal DOM (Virtual DOM) yapısı sayesinde web sayfaları hızlı bir şekilde güncellenir ve performans artar. Kısacası ReactJS, modern, hızlı ve ölçeklenebilir web uygulamaları geliştirmek için mükemmel bir araçtır.",
    "nodeJs": "Node.js, JavaScript’in sunucu tarafında çalışmasını sağlayan açık kaynaklı bir çalışma ortamıdır (runtime environment). Tarayıcı dışında da JavaScript çalıştırabilmeyi mümkün kılarak, web sunucuları ve backend (arka yüz) uygulamaları geliştirmeyi kolaylaştırır. Node.js, event-driven (olay odaklı) ve non-blocking (engellemesiz/asenkron) yapısı sayesinde yüksek performanslı ve ölçeklenebilir uygulamalar oluşturmayı sağlar. Ayrıca, geniş bir paket ekosistemi olan npm (Node Package Manager) ile birçok hazır kütüphane kullanmak mümkündür. Kısacası Node.js, modern web geliştirmede hem hızlı hem de verimli backend çözümleri sunan güçlü bir araçtır.",
    "dateOfBirth": "Doğum Tarihi",
    "dateOfBirthAnsw": "30.03.2001",
    "cityOfResidence": "İkamet Şehri",
    "cityOfResidenceAnsw": "Adana",
    "educationLevel": "Eğitim Durumu",
    "educationLevelAnsw": "Ön Lisans, \nBilgisayar Programcılığı, \n 2025",
    "preferredRole": "Tercih Ettiği Rol",
    "preferredRoleAnsw": "Ön Yüz Geliştirici",
    "profileAboutMe": "Hakkımda",
    "profileAboutMeAnsw": "Merhaba, kendim hakkında kısaca bahsetmek istiyorum. Programlamaya olan ilgim çocuk yaşlarımda başladı. 14-15 yaşlarım civarında scriptlere çok ilgi duyuyordum. Daha sonra temellerimi oluşturmak için C# diline odaklandım ve bu süreci bir script yayınlayarak tamamladım, ardından bir ara verdim. Şu anda kendimi front-end geliştirici alanına dahil ediyorum. Gelecekte ise, daha çok ilgi duyduğum back-end alanına da adım atacağımdan emin olabilirsiniz.",
    "project_1": "Workintech , benim yazılıma olan ilgimde asıl yol gösterici diyebilirim, çünkü yazılım bilgim olmasına karşın ne yapacağımı bilemezken bana yol göstererek ayrıca bilmediğim konulardada bilgi sahibi olmamı sağlayarak gerek hocaları gerek sistemli alt yapıları dolayısıyla başarılı bir süreç yaşadığımı bildirebilirim.",
    "project_2": "Workintech bünyesindeyken tanıştığım 'Alihan Güzel' öğretmenimizin yönlendirmesi ve talimatlarıyla geliştirdiğim yazı rengi bulma oyununu takdim ederim. Bu proje geliştirdiğim ilk front-end projelerimden bir tanesi. Bu projede kullandığım tüm kodları Github hesabımda açık bir şekilde paylaştım.",
    "project_3": "Web Pizza , bu projem yine Workintech bünyesindeyken hazırlamış olduğum bir front-end projesidir. Projede useState kavramları ve Props alma kısımlarında sıkça durarak bu konulardaki tecrübemi pratiğe dökmüş bulunmaktayım. İlginize sunarım , yine tüm kodlar açık bir şekilde Github hesabımda paylaştım.",
    "viewSite": "Siteyi Gör",
    "workFooterTgthr": "Birlikte çalışalım,\n ürününü birlikte geliştirelim.",
    "pBlog": "Kişisel Blog"
}
